Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_spi.c
/**
  ******************************************************************************
  * @file    py32e407_hal_spi.c
  * @author  MCU Application Team
  * @brief   SPI HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Serial Peripheral Interface (SPI) peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
    [..]
      The SPI HAL driver can be used as follows:

      (#) Declare a SPI_HandleTypeDef handle structure, for example:
          SPI_HandleTypeDef  hspi;

      (#)Initialize the SPI low level resources by implementing the HAL_SPI_MspInit() API:
          (##) Enable the SPIx interface clock
          (##) SPI pins configuration
              (+++) Enable the clock for the SPI GPIOs
              (+++) Configure these SPI pins as alternate function push-pull
          (##) NVIC configuration if you need to use interrupt process
              (+++) Configure the SPIx interrupt priority
              (+++) Enable the NVIC SPI IRQ handle
          (##) DMA Configuration if you need to use DMA process
              (+++) Declare a DMA_HandleTypeDef handle structure for the transmit or receive Stream/Channel
              (+++) Enable the DMAx clock
              (+++) Configure the DMA handle parameters
              (+++) Configure the DMA Tx or Rx Stream/Channel
              (+++) Associate the initialized hdma_tx(or _rx)  handle to the hspi DMA Tx or Rx handle
              (+++) Configure the priority and enable the NVIC for the transfer complete interrupt on the DMA Tx or Rx Stream/Channel

      (#) Program the Mode, BidirectionalMode , Data size, Baudrate Prescaler, NSS
          management, Clock polarity and phase, FirstBit and CRC configuration in the hspi Init structure.

      (#) Initialize the SPI registers by calling the HAL_SPI_Init() API:
          (++) This API configures also the low level Hardware GPIO, CLOCK, CORTEX...etc)
              by calling the customized HAL_SPI_MspInit() API.
     [..]
       Circular mode restriction:
      (#) The DMA circular mode cannot be used when the SPI is configured in these modes:
          (##) Master 2Lines RxOnly
          (##) Master 1Line Rx
      (#) The CRC feature is not managed when the DMA circular mode is enabled
      (#) When the SPI DMA Pause/Stop features are used, we must use the following APIs
          the HAL_SPI_DMAPause()/ HAL_SPI_DMAStop() only under the SPI callbacks
     [..]
       Master Receive mode restriction:
      (#) In Master unidirectional receive-only mode (MSTR =1, BIDIMODE=0, RXONLY=1) or
          bidirectional receive mode (MSTR=1, BIDIMODE=1, BIDIOE=0), to ensure that the SPI
          does not initiate a new transfer the following procedure has to be respected:
          (##) HAL_SPI_DeInit()
          (##) HAL_SPI_Init()
     [..]
       Callback registration:

      (#) The compilation flag USE_HAL_SPI_REGISTER_CALLBACKS when set to 1U
          allows the user to configure dynamically the driver callbacks.
          Use Functions HAL_SPI_RegisterCallback() to register an interrupt callback.

          Function HAL_SPI_RegisterCallback() allows to register following callbacks:
            (++) TxCpltCallback            : SPI Tx Completed callback
            (++) RxCpltCallback            : SPI Rx Completed callback
            (++) TxRxCpltCallback          : SPI TxRx Completed callback
            (++) TxBlockCpltCallback       : SPI Tx Block Completed callback
            (++) TxHalfBlockCpltCallback   : SPI Tx Half Block Completed callback
            (++) TxSrcCpltCallback         : SPI Tx Source Completed callback
            (++) RxBlockCpltCallback       : SPI Rx Block Completed callback
            (++) RxHalfBlockCpltCallback   : SPI Rx Half Block Completed callback
            (++) RxDstCpltCallback         : SPI Rx Destination Completed callback
            (++) TxRxBlockCpltCallback     : SPI TxRx Block Completed callback
            (++) TxRxHalfBlockCpltCallback : SPI TxRx Half Block Completed callback
            (++) ErrorCallback             : SPI Error callback
            (++) AbortCpltCallback         : SPI Abort callback
            (++) MspInitCallback           : SPI Msp Init callback
            (++) MspDeInitCallback         : SPI Msp DeInit callback
          This function takes as parameters the HAL peripheral handle, the Callback ID
          and a pointer to the user callback function.


      (#) Use function HAL_SPI_UnRegisterCallback to reset a callback to the default
          weak function.
          HAL_SPI_UnRegisterCallback takes as parameters the HAL peripheral handle,
          and the Callback ID.
          This function allows to reset following callbacks:
            (++) TxCpltCallback            : SPI Tx Completed callback
            (++) RxCpltCallback            : SPI Rx Completed callback
            (++) TxRxCpltCallback          : SPI TxRx Completed callback
            (++) TxBlockCpltCallback       : SPI Tx Block Completed callback
            (++) TxHalfBlockCpltCallback   : SPI Tx Half Block Completed callback
            (++) TxSrcCpltCallback         : SPI Tx Source Completed callback
            (++) RxBlockCpltCallback       : SPI Rx Block Completed callback
            (++) RxHalfBlockCpltCallback   : SPI Rx Half Block Completed callback
            (++) RxDstCpltCallback         : SPI Rx Destination Completed callback
            (++) TxRxBlockCpltCallback     : SPI TxRx Block Completed callback
            (++) TxRxHalfBlockCpltCallback : SPI TxRx Half Block Completed callback
            (++) ErrorCallback             : SPI Error callback
            (++) AbortCpltCallback         : SPI Abort callback
            (++) MspInitCallback           : SPI Msp Init callback
            (++) MspDeInitCallback         : SPI Msp DeInit callback

